IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_i2c_regs.xml
<module id="CM_I2C_REGS" HW_revision="" description="CM I2C Registers">
	<register id="I2CMSA" width="32" page="1" offset="0x0" internal="0" description="I2C Master Slave Address">
		<bitfield id="RS" description="Receive/Send" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SA" description="I2C Slave Address" begin="7" end="1" width="7" rwaccess="RW"/>
	</register>
	<register id="I2CMCS" width="32" page="1" offset="0x4" internal="0" description="I2C Master Control/Status">
		<bitfield id="BUSY" description="I2C Busy" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ERROR" description="Error" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADRACK" description="Acknowledge Address " begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DATACK" description="Acknowledge Data" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ARBLST" description="Arbitration Lost" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="IDLE" description="I2C Idle" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="BUSBSY" description="Bus Busy" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CLKTO" description="Clock Timeout Error" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ACTDMATX" description="DMA TX Active Status" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="ACTDMARX" description="DMA RX Active Status" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="I2CMDR" width="32" page="1" offset="0x8" internal="0" description="I2C Master Data">
		<bitfield id="DATA" description="Data transmitted/received" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="I2CMTPR" width="32" page="1" offset="0xc" internal="0" description="I2C Master Timer Period">
		<bitfield id="TPR" description="Timer Period" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="HS" description="High-Speed Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PULSEL" description="Glitch Suppression Pulse Width" begin="18" end="16" width="3" rwaccess="RW"/>
	</register>
	<register id="I2CMIMR" width="32" page="1" offset="0x10" internal="0" description="I2C Master Interrupt Mask">
		<bitfield id="IM" description="Master Interrupt Mask" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLKIM" description="Clock Timeout Interrupt Mask" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMARXIM" description="Receive DMA Interrupt Mask" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMATXIM" description="Transmit DMA Interrupt Mask" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="NACKIM" description="Address/Data NACK Interrupt Mask" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STARTIM" description="START Detection Interrupt Mask" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="STOPIM" description="STOP Detection Interrupt Mask" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ARBLOSTIM" description="Arbitration Lost Interrupt Mask" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TXIM" description="Transmit FIFO Request Interrupt Mask" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RXIM" description="Receive FIFO Request Interrupt Mask" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TXFEIM" description="Transmit FIFO Empty Interrupt Mask" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RXFFIM" description="Receive FIFO Full Interrupt Mask" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CMRIS" width="32" page="1" offset="0x14" internal="0" description="I2C Master Raw Interrupt Status">
		<bitfield id="RIS" description="Master Raw Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLKRIS" description="Clock Timeout Raw Interrupt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="DMARXRIS" description="Receive DMA Raw Interrupt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DMATXRIS" description="Transmit DMA Raw Interrupt Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="NACKRIS" description="Address/Data NACK Raw Interrupt Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="STARTRIS" description="START Detection Raw Interrupt Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="STOPRIS" description="STOP Detection Raw Interrupt Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ARBLOSTRIS" description="Arbitration Lost Raw Interrupt Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="TXRIS" description="Transmit Request Raw Interrupt Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="RXRIS" description="Receive FIFO Request Raw Interrupt Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="TXFERIS" description="Transmit FIFO Empty Raw Interrupt Status" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="RXFFRIS" description="Receive FIFO Full Raw Interrupt Status" begin="11" end="11" width="1" rwaccess="R"/>
	</register>
	<register id="I2CMMIS" width="32" page="1" offset="0x18" internal="0" description="I2C Master Masked Interrupt Status">
		<bitfield id="MIS" description="Masked Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLKMIS" description="Clock Timeout Masked Interrupt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="DMARXMIS" description="Receive DMA Interrupt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DMATXMIS" description="Transmit DMA Interrupt Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="NACKMIS" description="Address/Data NACK Interrupt Mask" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="STARTMIS" description="START Detection Interrupt Mask" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="STOPMIS" description="STOP Detection Interrupt Mask" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ARBLOSTMIS" description="Arbitration Lost Interrupt Mask" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="TXMIS" description="Transmit Request Interrupt Mask" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="RXMIS" description="Receive FIFO Request Interrupt Mask" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="TXFEMIS" description="Transmit FIFO Empty Interrupt Mask" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="RXFFMIS" description="Receive FIFO Full Interrupt Mask" begin="11" end="11" width="1" rwaccess="R"/>
	</register>
	<register id="I2CMICR" width="32" page="1" offset="0x1c" internal="0" description="I2C Master Interrupt Clear">
		<bitfield id="IC" description="Master Interrupt Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLKIC" description="Clock Timeout Interrupt Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMARXIC" description="Receive DMA Interrupt Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMATXIC" description="Transmit DMA Interrupt Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="NACKIC" description="Address/Data NACK Interrupt Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STARTIC" description="START Detection Interrupt Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="STOPIC" description="STOP Detection Interrupt Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ARBLOSTIC" description="Arbitration Lost Interrupt Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TXIC" description="Transmit FIFO Request Interrupt Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RXIC" description="Receive FIFO Request Interrupt Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TXFEIC" description="Transmit FIFO Empty Interrupt Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RXFFIC" description="Receive FIFO Full Interrupt Clear" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CMCR" width="32" page="1" offset="0x20" internal="0" description="I2C Master Configuration">
		<bitfield id="LPBK" description="I2C Loopback" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MFE" description="I2C Master Function Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SFE" description="I2C Slave Function Enable" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CMCLKOCNT" width="32" page="1" offset="0x24" internal="0" description="I2C Master Clock Low Timeout Count">
		<bitfield id="CNTL" description="I2C Master Count " begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="I2CMBMON" width="32" page="1" offset="0x2c" internal="0" description="I2C Master Bus Monitor">
		<bitfield id="SCL" description="I2C SCL Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SDA" description="I2C SDA Status" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="I2CMBLEN" width="32" page="1" offset="0x30" internal="0" description="I2C Master Burst Length">
		<bitfield id="CNTL" description="I2C Burst Length" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="I2CMBCNT" width="32" page="1" offset="0x34" internal="0" description="I2C Master Burst Count">
		<bitfield id="CNTL" description="I2C Master Burst Count " begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="I2CSOAR" width="32" page="1" offset="0x800" internal="0" description="I2C Slave Own Address">
		<bitfield id="OAR" description="I2C Slave Own Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="I2CSCSR" width="32" page="1" offset="0x804" internal="0" description="I2C Slave Control/Status">
		<bitfield id="RREQ" description="Receive Request" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="TREQ" description="Transmit Request" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="FBR" description="First Byte Received" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="OAR2SEL" description="OAR2 Address Matched" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="QCMDST" description="Quick Command Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="QCMDRW" description="Quick Command Read / Write" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ACTDMATX" description="DMA TX Active Status" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="ACTDMARX" description="DMA RX Active Status" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="I2CSDR" width="32" page="1" offset="0x808" internal="0" description="I2C Slave Data">
		<bitfield id="DATA" description="Data for Transfer" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="I2CSIMR" width="32" page="1" offset="0x80c" internal="0" description="I2C Slave Interrupt Mask">
		<bitfield id="DATAIM" description="Data Interrupt Mask" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STARTIM" description="Start Condition Interrupt Mask" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STOPIM" description="Stop Condition Interrupt Mask" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMARXIM" description="Receive DMA Interrupt Mask" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DMATXIM" description="Transmit DMA Interrupt Mask" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TXIM" description="Transmit FIFO Request Interrupt Mask" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RXIM" description="Receive FIFO Request Interrupt Mask" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TXFEIM" description="Transmit FIFO Empty Interrupt Mask" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RXFFIM" description="Receive FIFO Full Interrupt Mask" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CSRIS" width="32" page="1" offset="0x810" internal="0" description="I2C Slave Raw Interrupt Status">
		<bitfield id="DATARIS" description="Data Raw Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="STARTRIS" description="Start Condition Raw Interrupt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="STOPRIS" description="Stop Condition Raw Interrupt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DMARXRIS" description="Receive DMA Raw Interrupt Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="DMATXRIS" description="Transmit DMA Raw Interrupt Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="TXRIS" description="Transmit Request Raw Interrupt Status" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="RXRIS" description="Receive FIFO Request Raw Interrupt Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="TXFERIS" description="Transmit FIFO Empty Raw Interrupt Status" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RXFFRIS" description="Receive FIFO Full Raw Interrupt Status" begin="8" end="8" width="1" rwaccess="R"/>
	</register>
	<register id="I2CSMIS" width="32" page="1" offset="0x814" internal="0" description="I2C Slave Masked Interrupt Status">
		<bitfield id="DATAMIS" description="Data Masked Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="STARTMIS" description="Start Condition Masked Interrupt Status" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="STOPMIS" description="Stop Condition Masked Interrupt Status" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="DMARXMIS" description="Receive DMA Masked Interrupt Status" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="DMATXMIS" description="Transmit DMA Masked Interrupt Status" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="TXMIS" description="Transmit FIFO Request Interrupt Mask" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="RXMIS" description="Receive FIFO Request Interrupt Mask" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="TXFEMIS" description="Transmit FIFO Empty Interrupt Mask" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RXFFMIS" description="Receive FIFO Full Interrupt Mask" begin="8" end="8" width="1" rwaccess="R"/>
	</register>
	<register id="I2CSICR" width="32" page="1" offset="0x818" internal="0" description="I2C Slave Interrupt Clear">
		<bitfield id="DATAIC" description="Data Interrupt Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="STARTIC" description="Start Condition Interrupt Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STOPIC" description="Stop Condition Interrupt Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMARXIC" description="Receive DMA Interrupt Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DMATXIC" description="Transmit DMA Interrupt Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TXIC" description="Transmit Request Interrupt Mask" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RXIC" description="Receive Request Interrupt Mask" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TXFEIC" description="Transmit FIFO Empty Interrupt Mask" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RXFFIC" description="Receive FIFO Full Interrupt Mask" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CSOAR2" width="32" page="1" offset="0x81c" internal="0" description="I2C Slave Own Address 2">
		<bitfield id="OAR2" description="I2C Slave Own Address 2" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="OAR2EN" description="I2C Slave Own Address 2 Enable" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CSACKCTL" width="32" page="1" offset="0x820" internal="0" description="I2C Slave ACK Control">
		<bitfield id="ACKOEN" description="I2C Slave ACK Override Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACKOVAL" description="I2C Slave ACK Override Value" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CFIFODATARX" width="32" page="1" offset="0xf00" internal="0" description="I2C FIFO Data RX">
		<bitfield id="DATA" description="I2C RX FIFO Read Data Byte" begin="7" end="0" width="8" rwaccess="R"/>
	</register>
	<register id="I2CFIFOCTL" width="32" page="1" offset="0xf04" internal="0" description="I2C FIFO Control">
		<bitfield id="TXTRIG" description="TX FIFO Trigger" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="DMATXENA" description="DMA TX Channel Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TXFLUSH" description="TX FIFO Flush" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TXASGNMT" description="TX Control Assignment" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="RXTRIG" description="RX FIFO Trigger" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="DMARXENA" description="DMA RX Channel Enable" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="RXFLUSH" description="RX FIFO Flush" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="RXASGNMT" description="RX Control Assignment" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CFIFOSTATUS" width="32" page="1" offset="0xf08" internal="0" description="I2C FIFO Status">
		<bitfield id="TXFE" description="TX FIFO Empty" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="TXFF" description="TX FIFO Full" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="TXBLWTRIG" description="TX FIFO Below Trigger Level" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="RXFE" description="RX FIFO Empty" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="RXFF" description="RX FIFO Full" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="RXABVTRIG" description="RX FIFO Above Trigger Level" begin="18" end="18" width="1" rwaccess="R"/>
	</register>
	<register id="I2CPP" width="32" page="1" offset="0xfc0" internal="0" description="I2C Peripheral Properties">
		<bitfield id="HS" description="High-Speed Capable" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="I2CPC" width="32" page="1" offset="0xfc4" internal="0" description="I2C Peripheral Configuration">
		<bitfield id="HS" description="High-Speed Capable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
